/*
定义数组
  <类型>变量名称【元素数量】
  int gradesp[100]

  元素必须是整数
  C99之前：元素数量必须是编译时刻确定的字面量

什么是数组
  - 是一种容器
  - 其中所有的元素具有相同的数据类型
  - 一旦创建，不能改变大小
  - * 数组中的元素在内存中是连续依次排列的
    一个int的数组 int a[10]
    10个单元 a[0], a[1] ....a[9]
    每个单元就是一个int类型的值
    可以出现在赋值的左边或者右边：
      -  a[2] = a[1] + 6
    在赋值左边的叫做左值

数组的单元
  数组的每个单元就是数组类型的一个变量，数组下标从0开始 a[0]

有效的下标范围：
  - 编译器和运行环境都不会检查数组下标是否越界，无论对数组单元做读还是写
  - 一旦程序运行，越界的数组访问可能造成问题，导致程序奔溃
    segmentation fault
  - 数组的有效下标 [0, 数组的大小 -1]

长度为0的数组可以编译，但是无用

*/

#include <stdio.h>

void f();

int main()
{
  f();
  return 0;
}

void f(){
  int a[10];
  a[10] = 0;
}